{
  "word2idx": {
    "<PAD>": 0,
    "<UNK>": 1,
    "<Q>": 2,
    "<A>": 3,
    "<END>": 4,
    "是": 5,
    "。": 6,
    " ": 7,
    "回答": 8,
    "（": 9,
    "样本": 10,
    "）": 11,
    "这": 12,
    "第": 13,
    "个": 14,
    "示例": 15,
    "？": 16,
    "，": 17,
    "的": 18,
    "学习": 19,
    "什么": 20,
    "你": 21,
    "一个": 22,
    "我": 23,
    "机器": 24,
    "深度": 25,
    "神经网络": 26,
    "很": 27,
    "AI": 28,
    "人工智能": 29,
    "和": 30,
    "Python": 31,
    "一种": 32,
    "你好": 33,
    "高兴": 34,
    "分支": 35,
    "推荐": 36,
    "一部": 37,
    "电影": 38,
    "《": 39,
    "》": 40,
    "非常": 41,
    "可以": 42,
    "=": 43,
    "如何": 44,
    "编程": 45,
    "需要": 46,
    "从": 47,
    "中国": 48,
    "首都": 49,
    "流行": 50,
    "数据": 51,
    "呢": 52,
    "计算": 53,
    "LSTM": 54,
    "PyTorch": 55,
    "框架": 56,
    "TensorFlow": 57,
    "保持": 58,
    "健康": 59,
    "、": 60,
    "一本": 61,
    "未来": 62,
    "31": 63,
    "25": 64,
    "见到": 65,
    "！": 66,
    "叫": 67,
    "名字": 68,
    "助手": 69,
    "为": 70,
    "服务": 71,
    "今天天气": 72,
    "怎么样": 73,
    "今天": 74,
    "天气晴朗": 75,
    "温度": 76,
    "适宜": 77,
    "计算机科学": 78,
    "致力于": 79,
    "创造": 80,
    "智能": 81,
    "肖申克": 82,
    "救赎": 83,
    "经典": 84,
    "会": 85,
    "做": 86,
    "问题": 87,
    "进行": 88,
    "对话": 89,
    "交流": 90,
    "告诉": 91,
    "笑话": 92,
    "为什么": 93,
    "程序员": 94,
    "总是": 95,
    "分不清": 96,
    "万圣节": 97,
    "圣诞节": 98,
    "因为": 99,
    "Oct": 100,
    "Dec": 101,
    "多": 102,
    "练习": 103,
    "开始": 104,
    "入门": 105,
    "哪里": 106,
    "北京": 107,
    "喜欢": 108,
    "颜色": 109,
    "作为": 110,
    "没有": 111,
    "个人": 112,
    "偏好": 113,
    "但": 114,
    "蓝色": 115,
    "通常": 116,
    "受欢迎": 117,
    "编程语言": 118,
    "简单": 119,
    "易学": 120,
    "让": 121,
    "计算机": 122,
    "中": 123,
    "使用": 124,
    "模仿": 125,
    "人脑": 126,
    "神经元": 127,
    "结构": 128,
    "模型": 129,
    "循环": 130,
    "适合": 131,
    "处理": 132,
    "序列": 133,
    "开源": 134,
    "另": 135,
    "均衡": 136,
    "饮食": 137,
    "适量": 138,
    "运动": 139,
    "充足": 140,
    "睡眠": 141,
    "好书": 142,
    "人类": 143,
    "简史": 144,
    "值得": 145,
    "一": 146,
    "读的书": 147,
    "科技": 148,
    "发展趋势": 149,
    "量子": 150,
    "生物": 151,
    "技术": 152,
    "重要": 153,
    "方向": 154,
    "21": 155,
    "22": 156,
    "23": 157,
    "24": 158,
    "26": 159,
    "27": 160,
    "28": 161,
    "29": 162,
    "30": 163,
    "32": 164,
    "33": 165,
    "34": 166,
    "35": 167,
    "36": 168,
    "37": 169,
    "38": 170,
    "39": 171,
    "40": 172,
    "41": 173,
    "42": 174,
    "43": 175,
    "44": 176,
    "45": 177,
    "46": 178,
    "47": 179,
    "48": 180,
    "49": 181,
    "50": 182,
    "51": 183,
    "52": 184,
    "53": 185,
    "54": 186,
    "55": 187,
    "56": 188,
    "57": 189,
    "58": 190,
    "59": 191,
    "60": 192,
    "61": 193,
    "62": 194,
    "63": 195,
    "64": 196,
    "65": 197,
    "66": 198,
    "67": 199,
    "68": 200,
    "69": 201,
    "70": 202,
    "71": 203,
    "72": 204,
    "73": 205,
    "74": 206,
    "75": 207,
    "76": 208,
    "77": 209,
    "78": 210,
    "79": 211,
    "80": 212,
    "81": 213,
    "82": 214,
    "83": 215,
    "84": 216,
    "85": 217,
    "86": 218,
    "87": 219,
    "88": 220,
    "89": 221,
    "90": 222,
    "91": 223,
    "92": 224,
    "93": 225,
    "94": 226,
    "95": 227,
    "96": 228,
    "97": 229,
    "98": 230,
    "99": 231,
    "100": 232,
    "101": 233,
    "102": 234,
    "103": 235,
    "104": 236,
    "105": 237,
    "106": 238,
    "107": 239,
    "108": 240,
    "109": 241,
    "110": 242,
    "111": 243,
    "112": 244,
    "113": 245,
    "114": 246,
    "115": 247,
    "116": 248,
    "117": 249,
    "118": 250,
    "119": 251,
    "120": 252,
    "121": 253,
    "122": 254,
    "123": 255,
    "124": 256,
    "125": 257,
    "126": 258,
    "127": 259,
    "128": 260,
    "129": 261,
    "130": 262,
    "131": 263,
    "132": 264,
    "133": 265,
    "134": 266,
    "135": 267,
    "136": 268,
    "137": 269,
    "138": 270,
    "139": 271,
    "140": 272,
    "141": 273,
    "142": 274,
    "143": 275,
    "144": 276,
    "145": 277,
    "146": 278,
    "147": 279,
    "148": 280,
    "149": 281,
    "150": 282,
    "151": 283,
    "152": 284,
    "153": 285,
    "154": 286,
    "155": 287,
    "156": 288,
    "157": 289,
    "158": 290,
    "159": 291,
    "160": 292,
    "161": 293,
    "162": 294,
    "163": 295,
    "164": 296,
    "165": 297,
    "166": 298,
    "167": 299,
    "168": 300,
    "169": 301,
    "170": 302,
    "171": 303,
    "172": 304,
    "173": 305,
    "174": 306,
    "175": 307,
    "176": 308,
    "177": 309,
    "178": 310,
    "179": 311,
    "180": 312,
    "181": 313,
    "182": 314,
    "183": 315,
    "184": 316,
    "185": 317,
    "186": 318,
    "187": 319,
    "188": 320,
    "189": 321,
    "190": 322,
    "191": 323,
    "192": 324,
    "193": 325,
    "194": 326,
    "195": 327,
    "196": 328,
    "197": 329,
    "198": 330,
    "199": 331,
    "200": 332,
    "201": 333,
    "202": 334,
    "203": 335,
    "204": 336,
    "205": 337,
    "206": 338,
    "207": 339,
    "208": 340,
    "209": 341,
    "210": 342,
    "211": 343,
    "212": 344,
    "213": 345,
    "214": 346,
    "215": 347,
    "216": 348,
    "217": 349,
    "218": 350,
    "219": 351,
    "220": 352,
    "221": 353,
    "222": 354,
    "223": 355,
    "224": 356,
    "225": 357,
    "226": 358,
    "227": 359,
    "228": 360,
    "229": 361,
    "230": 362,
    "231": 363,
    "232": 364,
    "233": 365,
    "234": 366,
    "235": 367,
    "236": 368,
    "237": 369,
    "238": 370,
    "239": 371,
    "240": 372,
    "241": 373,
    "242": 374,
    "243": 375,
    "244": 376,
    "245": 377,
    "246": 378,
    "247": 379,
    "248": 380,
    "249": 381,
    "250": 382,
    "251": 383,
    "252": 384,
    "253": 385,
    "254": 386,
    "255": 387,
    "256": 388,
    "257": 389,
    "258": 390,
    "259": 391,
    "260": 392,
    "261": 393,
    "262": 394,
    "263": 395,
    "264": 396,
    "265": 397,
    "266": 398,
    "267": 399,
    "268": 400,
    "269": 401,
    "270": 402,
    "271": 403,
    "272": 404,
    "273": 405,
    "274": 406,
    "275": 407,
    "276": 408,
    "277": 409,
    "278": 410,
    "279": 411,
    "280": 412,
    "281": 413,
    "282": 414,
    "283": 415,
    "284": 416,
    "285": 417,
    "286": 418,
    "287": 419,
    "288": 420,
    "289": 421,
    "290": 422,
    "291": 423,
    "292": 424,
    "293": 425,
    "294": 426,
    "295": 427,
    "296": 428,
    "297": 429,
    "298": 430,
    "299": 431,
    "300": 432,
    "301": 433,
    "302": 434,
    "303": 435,
    "304": 436,
    "305": 437,
    "306": 438,
    "307": 439,
    "308": 440,
    "309": 441,
    "310": 442,
    "311": 443,
    "312": 444,
    "313": 445,
    "314": 446,
    "315": 447,
    "316": 448,
    "317": 449,
    "318": 450,
    "319": 451,
    "320": 452,
    "321": 453,
    "322": 454,
    "323": 455,
    "324": 456,
    "325": 457,
    "326": 458,
    "327": 459,
    "328": 460,
    "329": 461,
    "330": 462,
    "331": 463,
    "332": 464,
    "333": 465,
    "334": 466,
    "335": 467,
    "336": 468,
    "337": 469,
    "338": 470,
    "339": 471,
    "340": 472,
    "341": 473,
    "342": 474,
    "343": 475,
    "344": 476,
    "345": 477,
    "346": 478,
    "347": 479,
    "348": 480,
    "349": 481,
    "350": 482,
    "351": 483,
    "352": 484,
    "353": 485,
    "354": 486,
    "355": 487,
    "356": 488,
    "357": 489,
    "358": 490,
    "359": 491,
    "360": 492,
    "361": 493,
    "362": 494,
    "363": 495,
    "364": 496,
    "365": 497,
    "366": 498,
    "367": 499,
    "368": 500,
    "369": 501,
    "370": 502,
    "371": 503,
    "372": 504,
    "373": 505,
    "374": 506,
    "375": 507,
    "376": 508,
    "377": 509,
    "378": 510,
    "379": 511,
    "380": 512,
    "381": 513,
    "382": 514,
    "383": 515,
    "384": 516,
    "385": 517,
    "386": 518,
    "387": 519,
    "388": 520,
    "389": 521,
    "390": 522,
    "391": 523,
    "392": 524,
    "393": 525,
    "394": 526,
    "395": 527,
    "396": 528,
    "397": 529,
    "398": 530,
    "399": 531,
    "400": 532,
    "401": 533,
    "402": 534,
    "403": 535,
    "404": 536,
    "405": 537,
    "406": 538,
    "407": 539,
    "408": 540,
    "409": 541,
    "410": 542,
    "411": 543,
    "412": 544,
    "413": 545,
    "414": 546,
    "415": 547,
    "416": 548,
    "417": 549,
    "418": 550,
    "419": 551,
    "420": 552,
    "421": 553,
    "422": 554,
    "423": 555,
    "424": 556,
    "425": 557,
    "426": 558,
    "427": 559,
    "428": 560,
    "429": 561,
    "430": 562,
    "431": 563,
    "432": 564,
    "433": 565,
    "434": 566,
    "435": 567,
    "436": 568,
    "437": 569,
    "438": 570,
    "439": 571,
    "440": 572,
    "441": 573,
    "442": 574,
    "443": 575,
    "444": 576,
    "445": 577,
    "446": 578,
    "447": 579,
    "448": 580,
    "449": 581,
    "450": 582,
    "451": 583,
    "452": 584,
    "453": 585,
    "454": 586,
    "455": 587,
    "456": 588,
    "457": 589,
    "458": 590,
    "459": 591,
    "460": 592,
    "461": 593,
    "462": 594,
    "463": 595,
    "464": 596,
    "465": 597,
    "466": 598,
    "467": 599,
    "468": 600,
    "469": 601,
    "470": 602,
    "471": 603,
    "472": 604,
    "473": 605,
    "474": 606,
    "475": 607,
    "476": 608,
    "477": 609,
    "478": 610,
    "479": 611,
    "480": 612,
    "481": 613,
    "482": 614,
    "483": 615,
    "484": 616,
    "485": 617,
    "486": 618,
    "487": 619,
    "488": 620,
    "489": 621,
    "490": 622,
    "491": 623,
    "492": 624,
    "493": 625,
    "494": 626,
    "495": 627,
    "496": 628,
    "497": 629,
    "498": 630,
    "499": 631,
    "500": 632,
    "501": 633,
    "502": 634,
    "503": 635,
    "504": 636,
    "505": 637,
    "506": 638,
    "507": 639,
    "508": 640,
    "509": 641,
    "510": 642,
    "511": 643,
    "512": 644,
    "513": 645,
    "514": 646,
    "515": 647,
    "516": 648,
    "517": 649,
    "518": 650,
    "519": 651,
    "520": 652,
    "521": 653,
    "522": 654,
    "523": 655,
    "524": 656,
    "525": 657,
    "526": 658,
    "527": 659,
    "528": 660,
    "529": 661,
    "530": 662,
    "531": 663,
    "532": 664,
    "533": 665,
    "534": 666,
    "535": 667,
    "536": 668,
    "537": 669,
    "538": 670,
    "539": 671,
    "540": 672,
    "541": 673,
    "542": 674,
    "543": 675,
    "544": 676,
    "545": 677,
    "546": 678,
    "547": 679,
    "548": 680,
    "549": 681,
    "550": 682,
    "551": 683,
    "552": 684,
    "553": 685,
    "554": 686,
    "555": 687,
    "556": 688,
    "557": 689,
    "558": 690,
    "559": 691,
    "560": 692,
    "561": 693,
    "562": 694,
    "563": 695,
    "564": 696,
    "565": 697,
    "566": 698,
    "567": 699,
    "568": 700,
    "569": 701,
    "570": 702,
    "571": 703,
    "572": 704,
    "573": 705,
    "574": 706,
    "575": 707,
    "576": 708,
    "577": 709,
    "578": 710,
    "579": 711,
    "580": 712,
    "581": 713,
    "582": 714,
    "583": 715,
    "584": 716,
    "585": 717,
    "586": 718,
    "587": 719,
    "588": 720,
    "589": 721,
    "590": 722,
    "591": 723,
    "592": 724,
    "593": 725,
    "594": 726,
    "595": 727,
    "596": 728,
    "597": 729,
    "598": 730,
    "599": 731,
    "600": 732,
    "601": 733,
    "602": 734,
    "603": 735,
    "604": 736,
    "605": 737,
    "606": 738,
    "607": 739,
    "608": 740,
    "609": 741,
    "610": 742,
    "611": 743,
    "612": 744,
    "613": 745,
    "614": 746,
    "615": 747,
    "616": 748,
    "617": 749,
    "618": 750,
    "619": 751,
    "620": 752,
    "621": 753,
    "622": 754,
    "623": 755,
    "624": 756,
    "625": 757,
    "626": 758,
    "627": 759,
    "628": 760,
    "629": 761,
    "630": 762,
    "631": 763,
    "632": 764,
    "633": 765,
    "634": 766,
    "635": 767,
    "636": 768,
    "637": 769,
    "638": 770,
    "639": 771,
    "640": 772,
    "641": 773,
    "642": 774,
    "643": 775,
    "644": 776,
    "645": 777,
    "646": 778,
    "647": 779,
    "648": 780,
    "649": 781,
    "650": 782,
    "651": 783,
    "652": 784,
    "653": 785,
    "654": 786,
    "655": 787,
    "656": 788,
    "657": 789,
    "658": 790,
    "659": 791,
    "660": 792,
    "661": 793,
    "662": 794,
    "663": 795,
    "664": 796,
    "665": 797,
    "666": 798,
    "667": 799,
    "668": 800,
    "669": 801,
    "670": 802,
    "671": 803,
    "672": 804,
    "673": 805,
    "674": 806,
    "675": 807,
    "676": 808,
    "677": 809,
    "678": 810,
    "679": 811,
    "680": 812,
    "681": 813,
    "682": 814,
    "683": 815,
    "684": 816,
    "685": 817,
    "686": 818,
    "687": 819,
    "688": 820,
    "689": 821,
    "690": 822,
    "691": 823,
    "692": 824,
    "693": 825,
    "694": 826,
    "695": 827,
    "696": 828,
    "697": 829,
    "698": 830,
    "699": 831,
    "700": 832,
    "701": 833,
    "702": 834,
    "703": 835,
    "704": 836,
    "705": 837,
    "706": 838,
    "707": 839,
    "708": 840,
    "709": 841,
    "710": 842,
    "711": 843,
    "712": 844,
    "713": 845,
    "714": 846,
    "715": 847,
    "716": 848,
    "717": 849,
    "718": 850,
    "719": 851,
    "720": 852,
    "721": 853,
    "722": 854,
    "723": 855,
    "724": 856,
    "725": 857,
    "726": 858,
    "727": 859,
    "728": 860,
    "729": 861,
    "730": 862,
    "731": 863,
    "732": 864,
    "733": 865,
    "734": 866,
    "735": 867,
    "736": 868,
    "737": 869,
    "738": 870,
    "739": 871,
    "740": 872,
    "741": 873,
    "742": 874,
    "743": 875,
    "744": 876,
    "745": 877,
    "746": 878,
    "747": 879,
    "748": 880,
    "749": 881,
    "750": 882,
    "751": 883,
    "752": 884,
    "753": 885,
    "754": 886,
    "755": 887,
    "756": 888,
    "757": 889,
    "758": 890,
    "759": 891,
    "760": 892,
    "761": 893,
    "762": 894,
    "763": 895,
    "764": 896,
    "765": 897,
    "766": 898,
    "767": 899,
    "768": 900,
    "769": 901,
    "770": 902,
    "771": 903,
    "772": 904,
    "773": 905,
    "774": 906,
    "775": 907,
    "776": 908,
    "777": 909,
    "778": 910,
    "779": 911,
    "780": 912,
    "781": 913,
    "782": 914,
    "783": 915,
    "784": 916,
    "785": 917,
    "786": 918,
    "787": 919,
    "788": 920,
    "789": 921,
    "790": 922,
    "791": 923,
    "792": 924,
    "793": 925,
    "794": 926,
    "795": 927,
    "796": 928,
    "797": 929,
    "798": 930,
    "799": 931,
    "800": 932,
    "801": 933,
    "802": 934,
    "803": 935,
    "804": 936,
    "805": 937,
    "806": 938,
    "807": 939,
    "808": 940,
    "809": 941,
    "810": 942,
    "811": 943,
    "812": 944,
    "813": 945,
    "814": 946,
    "815": 947,
    "816": 948,
    "817": 949,
    "818": 950,
    "819": 951,
    "820": 952,
    "821": 953,
    "822": 954,
    "823": 955,
    "824": 956,
    "825": 957,
    "826": 958,
    "827": 959,
    "828": 960,
    "829": 961,
    "830": 962,
    "831": 963,
    "832": 964,
    "833": 965,
    "834": 966,
    "835": 967,
    "836": 968,
    "837": 969,
    "838": 970,
    "839": 971,
    "840": 972,
    "841": 973,
    "842": 974,
    "843": 975,
    "844": 976,
    "845": 977,
    "846": 978,
    "847": 979,
    "848": 980,
    "849": 981,
    "850": 982,
    "851": 983,
    "852": 984,
    "853": 985,
    "854": 986,
    "855": 987,
    "856": 988,
    "857": 989,
    "858": 990,
    "859": 991,
    "860": 992,
    "861": 993,
    "862": 994,
    "863": 995,
    "864": 996,
    "865": 997,
    "866": 998,
    "867": 999,
    "868": 1000,
    "869": 1001,
    "870": 1002,
    "871": 1003,
    "872": 1004,
    "873": 1005,
    "874": 1006,
    "875": 1007,
    "876": 1008,
    "877": 1009,
    "878": 1010,
    "879": 1011,
    "880": 1012,
    "881": 1013,
    "882": 1014,
    "883": 1015,
    "884": 1016,
    "885": 1017,
    "886": 1018,
    "887": 1019,
    "888": 1020,
    "889": 1021,
    "890": 1022,
    "891": 1023,
    "892": 1024,
    "893": 1025,
    "894": 1026,
    "895": 1027,
    "896": 1028,
    "897": 1029,
    "898": 1030,
    "899": 1031,
    "900": 1032,
    "901": 1033,
    "902": 1034,
    "903": 1035,
    "904": 1036,
    "905": 1037,
    "906": 1038,
    "907": 1039,
    "908": 1040,
    "909": 1041,
    "910": 1042,
    "911": 1043,
    "912": 1044,
    "913": 1045,
    "914": 1046,
    "915": 1047,
    "916": 1048,
    "917": 1049,
    "918": 1050,
    "919": 1051,
    "920": 1052,
    "921": 1053,
    "922": 1054,
    "923": 1055,
    "924": 1056,
    "925": 1057,
    "926": 1058,
    "927": 1059,
    "928": 1060,
    "929": 1061,
    "930": 1062,
    "931": 1063,
    "932": 1064,
    "933": 1065,
    "934": 1066,
    "935": 1067,
    "936": 1068,
    "937": 1069,
    "938": 1070,
    "939": 1071,
    "940": 1072,
    "941": 1073,
    "942": 1074,
    "943": 1075,
    "944": 1076,
    "945": 1077,
    "946": 1078,
    "947": 1079,
    "948": 1080,
    "949": 1081,
    "950": 1082,
    "951": 1083,
    "952": 1084,
    "953": 1085,
    "954": 1086,
    "955": 1087,
    "956": 1088,
    "957": 1089,
    "958": 1090,
    "959": 1091,
    "960": 1092,
    "961": 1093,
    "962": 1094,
    "963": 1095,
    "964": 1096,
    "965": 1097,
    "966": 1098,
    "967": 1099,
    "968": 1100,
    "969": 1101,
    "970": 1102,
    "971": 1103,
    "972": 1104,
    "973": 1105,
    "974": 1106,
    "975": 1107,
    "976": 1108,
    "977": 1109,
    "978": 1110,
    "979": 1111,
    "980": 1112,
    "981": 1113,
    "982": 1114,
    "983": 1115,
    "984": 1116,
    "985": 1117,
    "986": 1118,
    "987": 1119,
    "988": 1120,
    "989": 1121,
    "990": 1122,
    "991": 1123,
    "992": 1124,
    "993": 1125,
    "994": 1126,
    "995": 1127,
    "996": 1128,
    "997": 1129,
    "998": 1130,
    "999": 1131,
    "1000": 1132,
    "1001": 1133,
    "1002": 1134,
    "1003": 1135,
    "1004": 1136,
    "1005": 1137,
    "1006": 1138,
    "1007": 1139,
    "1008": 1140,
    "1009": 1141,
    "1010": 1142,
    "1011": 1143,
    "1012": 1144,
    "1013": 1145,
    "1014": 1146,
    "1015": 1147,
    "1016": 1148,
    "1017": 1149,
    "1018": 1150,
    "1019": 1151,
    "1020": 1152,
    "1021": 1153,
    "1022": 1154,
    "1023": 1155,
    "1024": 1156,
    "1025": 1157,
    "1026": 1158,
    "1027": 1159,
    "1028": 1160,
    "1029": 1161,
    "1030": 1162,
    "1031": 1163,
    "1032": 1164,
    "1033": 1165,
    "1034": 1166,
    "1035": 1167,
    "1036": 1168,
    "1037": 1169,
    "1038": 1170,
    "1039": 1171,
    "1040": 1172,
    "1041": 1173,
    "1042": 1174,
    "1043": 1175,
    "1044": 1176,
    "1045": 1177,
    "1046": 1178,
    "1047": 1179,
    "1048": 1180,
    "1049": 1181,
    "1050": 1182,
    "1051": 1183,
    "1052": 1184,
    "1053": 1185,
    "1054": 1186,
    "1055": 1187,
    "1056": 1188,
    "1057": 1189,
    "1058": 1190,
    "1059": 1191,
    "1060": 1192,
    "1061": 1193,
    "1062": 1194,
    "1063": 1195,
    "1064": 1196,
    "1065": 1197,
    "1066": 1198,
    "1067": 1199,
    "1068": 1200,
    "1069": 1201,
    "1070": 1202,
    "1071": 1203,
    "1072": 1204,
    "1073": 1205,
    "1074": 1206,
    "1075": 1207,
    "1076": 1208,
    "1077": 1209,
    "1078": 1210,
    "1079": 1211,
    "1080": 1212,
    "1081": 1213,
    "1082": 1214,
    "1083": 1215,
    "1084": 1216,
    "1085": 1217,
    "1086": 1218,
    "1087": 1219,
    "1088": 1220,
    "1089": 1221,
    "1090": 1222,
    "1091": 1223,
    "1092": 1224,
    "1093": 1225,
    "1094": 1226,
    "1095": 1227,
    "1096": 1228,
    "1097": 1229,
    "1098": 1230,
    "1099": 1231,
    "1100": 1232,
    "1101": 1233,
    "1102": 1234,
    "1103": 1235,
    "1104": 1236,
    "1105": 1237,
    "1106": 1238,
    "1107": 1239,
    "1108": 1240,
    "1109": 1241,
    "1110": 1242,
    "1111": 1243,
    "1112": 1244,
    "1113": 1245,
    "1114": 1246,
    "1115": 1247,
    "1116": 1248,
    "1117": 1249,
    "1118": 1250,
    "1119": 1251,
    "1120": 1252,
    "1121": 1253,
    "1122": 1254,
    "1123": 1255,
    "1124": 1256,
    "1125": 1257,
    "1126": 1258,
    "1127": 1259,
    "1128": 1260,
    "1129": 1261,
    "1130": 1262,
    "1131": 1263,
    "1132": 1264,
    "1133": 1265,
    "1134": 1266,
    "1135": 1267,
    "1136": 1268,
    "1137": 1269,
    "1138": 1270,
    "1139": 1271,
    "1140": 1272,
    "1141": 1273,
    "1142": 1274,
    "1143": 1275,
    "1144": 1276,
    "1145": 1277,
    "1146": 1278,
    "1147": 1279,
    "1148": 1280,
    "1149": 1281,
    "1150": 1282,
    "1151": 1283,
    "1152": 1284,
    "1153": 1285,
    "1154": 1286,
    "1155": 1287,
    "1156": 1288,
    "1157": 1289,
    "1158": 1290,
    "1159": 1291,
    "1160": 1292,
    "1161": 1293,
    "1162": 1294,
    "1163": 1295,
    "1164": 1296,
    "1165": 1297,
    "1166": 1298,
    "1167": 1299,
    "1168": 1300,
    "1169": 1301,
    "1170": 1302,
    "1171": 1303,
    "1172": 1304,
    "1173": 1305,
    "1174": 1306,
    "1175": 1307,
    "1176": 1308,
    "1177": 1309,
    "1178": 1310,
    "1179": 1311,
    "1180": 1312,
    "1181": 1313,
    "1182": 1314,
    "1183": 1315,
    "1184": 1316,
    "1185": 1317,
    "1186": 1318,
    "1187": 1319,
    "1188": 1320,
    "1189": 1321,
    "1190": 1322,
    "1191": 1323,
    "1192": 1324,
    "1193": 1325,
    "1194": 1326,
    "1195": 1327,
    "1196": 1328,
    "1197": 1329,
    "1198": 1330,
    "1199": 1331,
    "1200": 1332,
    "1201": 1333,
    "1202": 1334,
    "1203": 1335,
    "1204": 1336,
    "1205": 1337,
    "1206": 1338,
    "1207": 1339,
    "1208": 1340,
    "1209": 1341,
    "1210": 1342,
    "1211": 1343,
    "1212": 1344,
    "1213": 1345,
    "1214": 1346,
    "1215": 1347,
    "1216": 1348,
    "1217": 1349,
    "1218": 1350,
    "1219": 1351,
    "1220": 1352,
    "1221": 1353,
    "1222": 1354,
    "1223": 1355,
    "1224": 1356,
    "1225": 1357,
    "1226": 1358,
    "1227": 1359,
    "1228": 1360,
    "1229": 1361,
    "1230": 1362,
    "1231": 1363,
    "1232": 1364,
    "1233": 1365,
    "1234": 1366,
    "1235": 1367,
    "1236": 1368,
    "1237": 1369,
    "1238": 1370,
    "1239": 1371,
    "1240": 1372,
    "1241": 1373,
    "1242": 1374,
    "1243": 1375,
    "1244": 1376,
    "1245": 1377,
    "1246": 1378,
    "1247": 1379,
    "1248": 1380,
    "1249": 1381,
    "1250": 1382,
    "1251": 1383,
    "1252": 1384,
    "1253": 1385,
    "1254": 1386,
    "1255": 1387,
    "1256": 1388,
    "1257": 1389,
    "1258": 1390,
    "1259": 1391,
    "1260": 1392,
    "1261": 1393,
    "1262": 1394,
    "1263": 1395,
    "1264": 1396,
    "1265": 1397,
    "1266": 1398,
    "1267": 1399,
    "1268": 1400,
    "1269": 1401,
    "1270": 1402,
    "1271": 1403,
    "1272": 1404,
    "1273": 1405,
    "1274": 1406,
    "1275": 1407,
    "1276": 1408,
    "1277": 1409,
    "1278": 1410,
    "1279": 1411,
    "1280": 1412,
    "1281": 1413,
    "1282": 1414,
    "1283": 1415,
    "1284": 1416,
    "1285": 1417,
    "1286": 1418,
    "1287": 1419,
    "1288": 1420,
    "1289": 1421,
    "1290": 1422,
    "1291": 1423,
    "1292": 1424,
    "1293": 1425,
    "1294": 1426,
    "1295": 1427,
    "1296": 1428,
    "1297": 1429,
    "1298": 1430,
    "1299": 1431,
    "1300": 1432,
    "1301": 1433,
    "1302": 1434,
    "1303": 1435,
    "1304": 1436,
    "1305": 1437,
    "1306": 1438,
    "1307": 1439,
    "1308": 1440,
    "1309": 1441,
    "1310": 1442,
    "1311": 1443,
    "1312": 1444,
    "1313": 1445,
    "1314": 1446,
    "1315": 1447,
    "1316": 1448,
    "1317": 1449,
    "1318": 1450,
    "1319": 1451,
    "1320": 1452,
    "1321": 1453,
    "1322": 1454,
    "1323": 1455,
    "1324": 1456,
    "1325": 1457,
    "1326": 1458,
    "1327": 1459,
    "1328": 1460,
    "1329": 1461,
    "1330": 1462,
    "1331": 1463,
    "1332": 1464,
    "1333": 1465,
    "1334": 1466,
    "1335": 1467,
    "1336": 1468,
    "1337": 1469,
    "1338": 1470,
    "1339": 1471,
    "1340": 1472,
    "1341": 1473,
    "1342": 1474,
    "1343": 1475,
    "1344": 1476,
    "1345": 1477,
    "1346": 1478,
    "1347": 1479,
    "1348": 1480,
    "1349": 1481,
    "1350": 1482,
    "1351": 1483,
    "1352": 1484,
    "1353": 1485,
    "1354": 1486,
    "1355": 1487,
    "1356": 1488,
    "1357": 1489,
    "1358": 1490,
    "1359": 1491,
    "1360": 1492,
    "1361": 1493,
    "1362": 1494,
    "1363": 1495,
    "1364": 1496,
    "1365": 1497,
    "1366": 1498,
    "1367": 1499,
    "1368": 1500,
    "1369": 1501,
    "1370": 1502,
    "1371": 1503,
    "1372": 1504,
    "1373": 1505,
    "1374": 1506,
    "1375": 1507,
    "1376": 1508,
    "1377": 1509,
    "1378": 1510,
    "1379": 1511,
    "1380": 1512,
    "1381": 1513,
    "1382": 1514,
    "1383": 1515,
    "1384": 1516,
    "1385": 1517,
    "1386": 1518,
    "1387": 1519,
    "1388": 1520,
    "1389": 1521,
    "1390": 1522,
    "1391": 1523,
    "1392": 1524,
    "1393": 1525,
    "1394": 1526,
    "1395": 1527,
    "1396": 1528,
    "1397": 1529,
    "1398": 1530,
    "1399": 1531,
    "1400": 1532,
    "1401": 1533,
    "1402": 1534,
    "1403": 1535,
    "1404": 1536,
    "1405": 1537,
    "1406": 1538,
    "1407": 1539,
    "1408": 1540,
    "1409": 1541,
    "1410": 1542,
    "1411": 1543,
    "1412": 1544,
    "1413": 1545,
    "1414": 1546,
    "1415": 1547,
    "1416": 1548,
    "1417": 1549,
    "1418": 1550,
    "1419": 1551,
    "1420": 1552,
    "1421": 1553,
    "1422": 1554,
    "1423": 1555,
    "1424": 1556,
    "1425": 1557,
    "1426": 1558,
    "1427": 1559,
    "1428": 1560,
    "1429": 1561,
    "1430": 1562,
    "1431": 1563,
    "1432": 1564,
    "1433": 1565,
    "1434": 1566,
    "1435": 1567,
    "1436": 1568,
    "1437": 1569,
    "1438": 1570,
    "1439": 1571,
    "1440": 1572,
    "1441": 1573,
    "1442": 1574,
    "1443": 1575,
    "1444": 1576,
    "1445": 1577,
    "1446": 1578,
    "1447": 1579,
    "1448": 1580,
    "1449": 1581,
    "1450": 1582,
    "1451": 1583,
    "1452": 1584,
    "1453": 1585,
    "1454": 1586,
    "1455": 1587,
    "1456": 1588,
    "1457": 1589,
    "1458": 1590,
    "1459": 1591,
    "1460": 1592,
    "1461": 1593,
    "1462": 1594,
    "1463": 1595,
    "1464": 1596,
    "1465": 1597,
    "1466": 1598,
    "1467": 1599,
    "1468": 1600,
    "1469": 1601,
    "1470": 1602,
    "1471": 1603,
    "1472": 1604,
    "1473": 1605,
    "1474": 1606,
    "1475": 1607,
    "1476": 1608,
    "1477": 1609,
    "1478": 1610,
    "1479": 1611,
    "1480": 1612,
    "1481": 1613,
    "1482": 1614,
    "1483": 1615,
    "1484": 1616,
    "1485": 1617,
    "1486": 1618,
    "1487": 1619,
    "1488": 1620,
    "1489": 1621,
    "1490": 1622,
    "1491": 1623,
    "1492": 1624,
    "1493": 1625,
    "1494": 1626,
    "1495": 1627,
    "1496": 1628,
    "1497": 1629,
    "1498": 1630,
    "1499": 1631,
    "1500": 1632,
    "1501": 1633,
    "1502": 1634,
    "1503": 1635,
    "1504": 1636,
    "1505": 1637,
    "1506": 1638,
    "1507": 1639,
    "1508": 1640,
    "1509": 1641,
    "1510": 1642,
    "1511": 1643,
    "1512": 1644,
    "1513": 1645,
    "1514": 1646,
    "1515": 1647,
    "1516": 1648,
    "1517": 1649,
    "1518": 1650,
    "1519": 1651,
    "1520": 1652,
    "1521": 1653,
    "1522": 1654,
    "1523": 1655,
    "1524": 1656,
    "1525": 1657,
    "1526": 1658,
    "1527": 1659,
    "1528": 1660,
    "1529": 1661,
    "1530": 1662,
    "1531": 1663,
    "1532": 1664,
    "1533": 1665,
    "1534": 1666,
    "1535": 1667,
    "1536": 1668,
    "1537": 1669,
    "1538": 1670,
    "1539": 1671,
    "1540": 1672,
    "1541": 1673,
    "1542": 1674,
    "1543": 1675,
    "1544": 1676,
    "1545": 1677,
    "1546": 1678,
    "1547": 1679,
    "1548": 1680,
    "1549": 1681,
    "1550": 1682,
    "1551": 1683,
    "1552": 1684,
    "1553": 1685,
    "1554": 1686,
    "1555": 1687,
    "1556": 1688,
    "1557": 1689,
    "1558": 1690,
    "1559": 1691,
    "1560": 1692,
    "1561": 1693,
    "1562": 1694,
    "1563": 1695,
    "1564": 1696,
    "1565": 1697,
    "1566": 1698,
    "1567": 1699,
    "1568": 1700,
    "1569": 1701,
    "1570": 1702,
    "1571": 1703,
    "1572": 1704,
    "1573": 1705,
    "1574": 1706,
    "1575": 1707,
    "1576": 1708,
    "1577": 1709,
    "1578": 1710,
    "1579": 1711,
    "1580": 1712,
    "1581": 1713,
    "1582": 1714,
    "1583": 1715,
    "1584": 1716,
    "1585": 1717,
    "1586": 1718,
    "1587": 1719,
    "1588": 1720,
    "1589": 1721,
    "1590": 1722,
    "1591": 1723,
    "1592": 1724,
    "1593": 1725,
    "1594": 1726,
    "1595": 1727,
    "1596": 1728,
    "1597": 1729,
    "1598": 1730,
    "1599": 1731,
    "1600": 1732,
    "1601": 1733,
    "1602": 1734,
    "1603": 1735,
    "1604": 1736,
    "1605": 1737,
    "1606": 1738,
    "1607": 1739,
    "1608": 1740,
    "1609": 1741,
    "1610": 1742,
    "1611": 1743,
    "1612": 1744,
    "1613": 1745,
    "1614": 1746,
    "1615": 1747,
    "1616": 1748,
    "1617": 1749,
    "1618": 1750,
    "1619": 1751,
    "1620": 1752,
    "1621": 1753,
    "1622": 1754,
    "1623": 1755,
    "1624": 1756,
    "1625": 1757,
    "1626": 1758,
    "1627": 1759,
    "1628": 1760,
    "1629": 1761,
    "1630": 1762,
    "1631": 1763,
    "1632": 1764,
    "1633": 1765,
    "1634": 1766,
    "1635": 1767,
    "1636": 1768,
    "1637": 1769,
    "1638": 1770,
    "1639": 1771,
    "1640": 1772,
    "1641": 1773,
    "1642": 1774,
    "1643": 1775,
    "1644": 1776,
    "1645": 1777,
    "1646": 1778,
    "1647": 1779,
    "1648": 1780,
    "1649": 1781,
    "1650": 1782,
    "1651": 1783,
    "1652": 1784,
    "1653": 1785,
    "1654": 1786,
    "1655": 1787,
    "1656": 1788,
    "1657": 1789,
    "1658": 1790,
    "1659": 1791,
    "1660": 1792,
    "1661": 1793,
    "1662": 1794,
    "1663": 1795,
    "1664": 1796,
    "1665": 1797,
    "1666": 1798,
    "1667": 1799,
    "1668": 1800,
    "1669": 1801,
    "1670": 1802,
    "1671": 1803,
    "1672": 1804,
    "1673": 1805,
    "1674": 1806,
    "1675": 1807,
    "1676": 1808,
    "1677": 1809,
    "1678": 1810,
    "1679": 1811,
    "1680": 1812,
    "1681": 1813,
    "1682": 1814,
    "1683": 1815,
    "1684": 1816,
    "1685": 1817,
    "1686": 1818,
    "1687": 1819,
    "1688": 1820,
    "1689": 1821,
    "1690": 1822,
    "1691": 1823,
    "1692": 1824,
    "1693": 1825,
    "1694": 1826,
    "1695": 1827,
    "1696": 1828,
    "1697": 1829,
    "1698": 1830,
    "1699": 1831,
    "1700": 1832,
    "1701": 1833,
    "1702": 1834,
    "1703": 1835,
    "1704": 1836,
    "1705": 1837,
    "1706": 1838,
    "1707": 1839,
    "1708": 1840,
    "1709": 1841,
    "1710": 1842,
    "1711": 1843,
    "1712": 1844,
    "1713": 1845,
    "1714": 1846,
    "1715": 1847,
    "1716": 1848,
    "1717": 1849,
    "1718": 1850,
    "1719": 1851,
    "1720": 1852,
    "1721": 1853,
    "1722": 1854,
    "1723": 1855,
    "1724": 1856,
    "1725": 1857,
    "1726": 1858,
    "1727": 1859,
    "1728": 1860,
    "1729": 1861,
    "1730": 1862,
    "1731": 1863,
    "1732": 1864,
    "1733": 1865,
    "1734": 1866,
    "1735": 1867,
    "1736": 1868,
    "1737": 1869,
    "1738": 1870,
    "1739": 1871,
    "1740": 1872,
    "1741": 1873,
    "1742": 1874,
    "1743": 1875,
    "1744": 1876,
    "1745": 1877,
    "1746": 1878,
    "1747": 1879,
    "1748": 1880,
    "1749": 1881,
    "1750": 1882,
    "1751": 1883,
    "1752": 1884,
    "1753": 1885,
    "1754": 1886,
    "1755": 1887,
    "1756": 1888,
    "1757": 1889,
    "1758": 1890,
    "1759": 1891,
    "1760": 1892,
    "1761": 1893,
    "1762": 1894,
    "1763": 1895,
    "1764": 1896,
    "1765": 1897,
    "1766": 1898,
    "1767": 1899,
    "1768": 1900,
    "1769": 1901,
    "1770": 1902,
    "1771": 1903,
    "1772": 1904,
    "1773": 1905,
    "1774": 1906,
    "1775": 1907,
    "1776": 1908,
    "1777": 1909,
    "1778": 1910,
    "1779": 1911,
    "1780": 1912,
    "1781": 1913,
    "1782": 1914,
    "1783": 1915,
    "1784": 1916,
    "1785": 1917,
    "1786": 1918,
    "1787": 1919,
    "1788": 1920,
    "1789": 1921,
    "1790": 1922,
    "1791": 1923,
    "1792": 1924,
    "1793": 1925,
    "1794": 1926,
    "1795": 1927,
    "1796": 1928,
    "1797": 1929,
    "1798": 1930,
    "1799": 1931,
    "1800": 1932,
    "1801": 1933,
    "1802": 1934,
    "1803": 1935,
    "1804": 1936,
    "1805": 1937,
    "1806": 1938,
    "1807": 1939,
    "1808": 1940,
    "1809": 1941,
    "1810": 1942,
    "1811": 1943,
    "1812": 1944,
    "1813": 1945,
    "1814": 1946,
    "1815": 1947,
    "1816": 1948,
    "1817": 1949,
    "1818": 1950,
    "1819": 1951,
    "1820": 1952,
    "1821": 1953,
    "1822": 1954,
    "1823": 1955,
    "1824": 1956,
    "1825": 1957,
    "1826": 1958,
    "1827": 1959,
    "1828": 1960,
    "1829": 1961,
    "1830": 1962,
    "1831": 1963,
    "1832": 1964,
    "1833": 1965,
    "1834": 1966,
    "1835": 1967,
    "1836": 1968,
    "1837": 1969,
    "1838": 1970,
    "1839": 1971,
    "1840": 1972,
    "1841": 1973,
    "1842": 1974,
    "1843": 1975,
    "1844": 1976,
    "1845": 1977,
    "1846": 1978,
    "1847": 1979,
    "1848": 1980,
    "1849": 1981,
    "1850": 1982,
    "1851": 1983,
    "1852": 1984,
    "1853": 1985,
    "1854": 1986,
    "1855": 1987,
    "1856": 1988,
    "1857": 1989,
    "1858": 1990,
    "1859": 1991,
    "1860": 1992,
    "1861": 1993,
    "1862": 1994,
    "1863": 1995,
    "1864": 1996,
    "1865": 1997,
    "1866": 1998,
    "1867": 1999,
    "1868": 2000,
    "1869": 2001,
    "1870": 2002,
    "1871": 2003,
    "1872": 2004,
    "1873": 2005,
    "1874": 2006,
    "1875": 2007,
    "1876": 2008,
    "1877": 2009,
    "1878": 2010,
    "1879": 2011,
    "1880": 2012,
    "1881": 2013,
    "1882": 2014,
    "1883": 2015,
    "1884": 2016,
    "1885": 2017,
    "1886": 2018,
    "1887": 2019,
    "1888": 2020,
    "1889": 2021,
    "1890": 2022,
    "1891": 2023,
    "1892": 2024,
    "1893": 2025,
    "1894": 2026,
    "1895": 2027,
    "1896": 2028,
    "1897": 2029,
    "1898": 2030,
    "1899": 2031,
    "1900": 2032,
    "1901": 2033,
    "1902": 2034,
    "1903": 2035,
    "1904": 2036,
    "1905": 2037,
    "1906": 2038,
    "1907": 2039,
    "1908": 2040,
    "1909": 2041,
    "1910": 2042,
    "1911": 2043,
    "1912": 2044,
    "1913": 2045,
    "1914": 2046,
    "1915": 2047,
    "1916": 2048,
    "1917": 2049,
    "1918": 2050,
    "1919": 2051,
    "1920": 2052,
    "1921": 2053,
    "1922": 2054,
    "1923": 2055,
    "1924": 2056,
    "1925": 2057,
    "1926": 2058,
    "1927": 2059,
    "1928": 2060,
    "1929": 2061,
    "1930": 2062,
    "1931": 2063,
    "1932": 2064,
    "1933": 2065,
    "1934": 2066,
    "1935": 2067,
    "1936": 2068,
    "1937": 2069,
    "1938": 2070,
    "1939": 2071,
    "1940": 2072,
    "1941": 2073,
    "1942": 2074,
    "1943": 2075,
    "1944": 2076,
    "1945": 2077,
    "1946": 2078,
    "1947": 2079,
    "1948": 2080,
    "1949": 2081,
    "1950": 2082,
    "1951": 2083,
    "1952": 2084,
    "1953": 2085,
    "1954": 2086,
    "1955": 2087,
    "1956": 2088,
    "1957": 2089,
    "1958": 2090,
    "1959": 2091,
    "1960": 2092,
    "1961": 2093,
    "1962": 2094,
    "1963": 2095,
    "1964": 2096,
    "1965": 2097,
    "1966": 2098,
    "1967": 2099,
    "1968": 2100,
    "1969": 2101,
    "1970": 2102,
    "1971": 2103,
    "1972": 2104,
    "1973": 2105,
    "1974": 2106,
    "1975": 2107,
    "1976": 2108,
    "1977": 2109,
    "1978": 2110,
    "1979": 2111,
    "1980": 2112,
    "1981": 2113,
    "1982": 2114,
    "1983": 2115,
    "1984": 2116,
    "1985": 2117,
    "1986": 2118,
    "1987": 2119,
    "1988": 2120,
    "1989": 2121,
    "1990": 2122,
    "1991": 2123,
    "1992": 2124,
    "1993": 2125,
    "1994": 2126,
    "1995": 2127,
    "1996": 2128,
    "1997": 2129,
    "1998": 2130,
    "1999": 2131,
    "2000": 2132,
    "2001": 2133,
    "2002": 2134,
    "2003": 2135,
    "2004": 2136,
    "2005": 2137,
    "2006": 2138,
    "2007": 2139,
    "2008": 2140,
    "2009": 2141,
    "2010": 2142,
    "2011": 2143,
    "2012": 2144,
    "2013": 2145,
    "2014": 2146,
    "2015": 2147,
    "2016": 2148,
    "2017": 2149,
    "2018": 2150,
    "2019": 2151,
    "2020": 2152,
    "2021": 2153,
    "2022": 2154,
    "2023": 2155,
    "2024": 2156,
    "2025": 2157,
    "2026": 2158,
    "2027": 2159,
    "2028": 2160,
    "2029": 2161,
    "2030": 2162,
    "2031": 2163,
    "2032": 2164,
    "2033": 2165,
    "2034": 2166,
    "2035": 2167,
    "2036": 2168,
    "2037": 2169,
    "2038": 2170,
    "2039": 2171,
    "2040": 2172,
    "2041": 2173,
    "2042": 2174,
    "2043": 2175,
    "2044": 2176,
    "2045": 2177,
    "2046": 2178,
    "2047": 2179,
    "2048": 2180,
    "2049": 2181,
    "2050": 2182,
    "2051": 2183,
    "2052": 2184,
    "2053": 2185,
    "2054": 2186,
    "2055": 2187,
    "2056": 2188,
    "2057": 2189,
    "2058": 2190,
    "2059": 2191,
    "2060": 2192,
    "2061": 2193,
    "2062": 2194,
    "2063": 2195,
    "2064": 2196,
    "2065": 2197,
    "2066": 2198,
    "2067": 2199,
    "2068": 2200,
    "2069": 2201,
    "2070": 2202,
    "2071": 2203,
    "2072": 2204,
    "2073": 2205,
    "2074": 2206,
    "2075": 2207,
    "2076": 2208,
    "2077": 2209,
    "2078": 2210,
    "2079": 2211,
    "2080": 2212,
    "2081": 2213,
    "2082": 2214,
    "2083": 2215,
    "2084": 2216,
    "2085": 2217,
    "2086": 2218,
    "2087": 2219,
    "2088": 2220,
    "2089": 2221,
    "2090": 2222,
    "2091": 2223,
    "2092": 2224,
    "2093": 2225,
    "2094": 2226,
    "2095": 2227,
    "2096": 2228,
    "2097": 2229,
    "2098": 2230,
    "2099": 2231,
    "2100": 2232,
    "2101": 2233,
    "2102": 2234,
    "2103": 2235,
    "2104": 2236,
    "2105": 2237,
    "2106": 2238,
    "2107": 2239,
    "2108": 2240,
    "2109": 2241,
    "2110": 2242,
    "2111": 2243,
    "2112": 2244,
    "2113": 2245,
    "2114": 2246,
    "2115": 2247,
    "2116": 2248,
    "2117": 2249,
    "2118": 2250,
    "2119": 2251,
    "2120": 2252,
    "2121": 2253,
    "2122": 2254,
    "2123": 2255,
    "2124": 2256,
    "2125": 2257,
    "2126": 2258,
    "2127": 2259,
    "2128": 2260,
    "2129": 2261,
    "2130": 2262,
    "2131": 2263,
    "2132": 2264,
    "2133": 2265,
    "2134": 2266,
    "2135": 2267,
    "2136": 2268,
    "2137": 2269,
    "2138": 2270,
    "2139": 2271,
    "2140": 2272,
    "2141": 2273,
    "2142": 2274,
    "2143": 2275,
    "2144": 2276,
    "2145": 2277,
    "2146": 2278,
    "2147": 2279,
    "2148": 2280,
    "2149": 2281,
    "2150": 2282,
    "2151": 2283,
    "2152": 2284,
    "2153": 2285,
    "2154": 2286,
    "2155": 2287,
    "2156": 2288,
    "2157": 2289,
    "2158": 2290,
    "2159": 2291,
    "2160": 2292,
    "2161": 2293,
    "2162": 2294,
    "2163": 2295,
    "2164": 2296,
    "2165": 2297,
    "2166": 2298,
    "2167": 2299,
    "2168": 2300,
    "2169": 2301,
    "2170": 2302,
    "2171": 2303,
    "2172": 2304,
    "2173": 2305,
    "2174": 2306,
    "2175": 2307,
    "2176": 2308,
    "2177": 2309,
    "2178": 2310,
    "2179": 2311,
    "2180": 2312,
    "2181": 2313,
    "2182": 2314,
    "2183": 2315,
    "2184": 2316,
    "2185": 2317,
    "2186": 2318,
    "2187": 2319,
    "2188": 2320,
    "2189": 2321,
    "2190": 2322,
    "2191": 2323,
    "2192": 2324,
    "2193": 2325,
    "2194": 2326,
    "2195": 2327,
    "2196": 2328,
    "2197": 2329,
    "2198": 2330,
    "2199": 2331,
    "2200": 2332,
    "2201": 2333,
    "2202": 2334,
    "2203": 2335,
    "2204": 2336,
    "2205": 2337,
    "2206": 2338,
    "2207": 2339,
    "2208": 2340,
    "2209": 2341,
    "2210": 2342,
    "2211": 2343,
    "2212": 2344,
    "2213": 2345,
    "2214": 2346,
    "2215": 2347,
    "2216": 2348,
    "2217": 2349,
    "2218": 2350,
    "2219": 2351,
    "2220": 2352,
    "2221": 2353,
    "2222": 2354,
    "2223": 2355,
    "2224": 2356,
    "2225": 2357,
    "2226": 2358,
    "2227": 2359,
    "2228": 2360,
    "2229": 2361,
    "2230": 2362,
    "2231": 2363,
    "2232": 2364,
    "2233": 2365,
    "2234": 2366,
    "2235": 2367,
    "2236": 2368,
    "2237": 2369,
    "2238": 2370,
    "2239": 2371,
    "2240": 2372,
    "2241": 2373,
    "2242": 2374,
    "2243": 2375,
    "2244": 2376,
    "2245": 2377,
    "2246": 2378,
    "2247": 2379,
    "2248": 2380,
    "2249": 2381,
    "2250": 2382,
    "2251": 2383,
    "2252": 2384,
    "2253": 2385,
    "2254": 2386,
    "2255": 2387,
    "2256": 2388,
    "2257": 2389,
    "2258": 2390,
    "2259": 2391,
    "2260": 2392,
    "2261": 2393,
    "2262": 2394,
    "2263": 2395,
    "2264": 2396,
    "2265": 2397,
    "2266": 2398,
    "2267": 2399,
    "2268": 2400,
    "2269": 2401,
    "2270": 2402,
    "2271": 2403,
    "2272": 2404,
    "2273": 2405,
    "2274": 2406,
    "2275": 2407,
    "2276": 2408,
    "2277": 2409,
    "2278": 2410,
    "2279": 2411,
    "2280": 2412,
    "2281": 2413,
    "2282": 2414,
    "2283": 2415,
    "2284": 2416,
    "2285": 2417,
    "2286": 2418,
    "2287": 2419,
    "2288": 2420,
    "2289": 2421,
    "2290": 2422,
    "2291": 2423,
    "2292": 2424,
    "2293": 2425,
    "2294": 2426,
    "2295": 2427,
    "2296": 2428,
    "2297": 2429,
    "2298": 2430,
    "2299": 2431,
    "2300": 2432,
    "2301": 2433,
    "2302": 2434,
    "2303": 2435,
    "2304": 2436,
    "2305": 2437,
    "2306": 2438,
    "2307": 2439,
    "2308": 2440,
    "2309": 2441,
    "2310": 2442,
    "2311": 2443,
    "2312": 2444,
    "2313": 2445,
    "2314": 2446,
    "2315": 2447,
    "2316": 2448,
    "2317": 2449,
    "2318": 2450,
    "2319": 2451,
    "2320": 2452,
    "2321": 2453,
    "2322": 2454,
    "2323": 2455,
    "2324": 2456,
    "2325": 2457,
    "2326": 2458,
    "2327": 2459,
    "2328": 2460,
    "2329": 2461,
    "2330": 2462,
    "2331": 2463,
    "2332": 2464,
    "2333": 2465,
    "2334": 2466,
    "2335": 2467,
    "2336": 2468,
    "2337": 2469,
    "2338": 2470,
    "2339": 2471,
    "2340": 2472,
    "2341": 2473,
    "2342": 2474,
    "2343": 2475,
    "2344": 2476,
    "2345": 2477,
    "2346": 2478,
    "2347": 2479,
    "2348": 2480,
    "2349": 2481,
    "2350": 2482,
    "2351": 2483,
    "2352": 2484,
    "2353": 2485,
    "2354": 2486,
    "2355": 2487,
    "2356": 2488,
    "2357": 2489,
    "2358": 2490,
    "2359": 2491,
    "2360": 2492,
    "2361": 2493,
    "2362": 2494,
    "2363": 2495,
    "2364": 2496,
    "2365": 2497,
    "2366": 2498,
    "2367": 2499,
    "2368": 2500,
    "2369": 2501,
    "2370": 2502,
    "2371": 2503,
    "2372": 2504,
    "2373": 2505,
    "2374": 2506,
    "2375": 2507,
    "2376": 2508,
    "2377": 2509,
    "2378": 2510,
    "2379": 2511,
    "2380": 2512,
    "2381": 2513,
    "2382": 2514,
    "2383": 2515,
    "2384": 2516,
    "2385": 2517,
    "2386": 2518,
    "2387": 2519,
    "2388": 2520,
    "2389": 2521,
    "2390": 2522,
    "2391": 2523,
    "2392": 2524,
    "2393": 2525,
    "2394": 2526,
    "2395": 2527,
    "2396": 2528,
    "2397": 2529,
    "2398": 2530,
    "2399": 2531,
    "2400": 2532,
    "2401": 2533,
    "2402": 2534,
    "2403": 2535,
    "2404": 2536,
    "2405": 2537,
    "2406": 2538,
    "2407": 2539,
    "2408": 2540,
    "2409": 2541,
    "2410": 2542,
    "2411": 2543,
    "2412": 2544,
    "2413": 2545,
    "2414": 2546,
    "2415": 2547,
    "2416": 2548,
    "2417": 2549,
    "2418": 2550,
    "2419": 2551,
    "2420": 2552,
    "2421": 2553,
    "2422": 2554,
    "2423": 2555,
    "2424": 2556,
    "2425": 2557,
    "2426": 2558,
    "2427": 2559,
    "2428": 2560,
    "2429": 2561,
    "2430": 2562,
    "2431": 2563,
    "2432": 2564,
    "2433": 2565,
    "2434": 2566,
    "2435": 2567,
    "2436": 2568,
    "2437": 2569,
    "2438": 2570,
    "2439": 2571,
    "2440": 2572,
    "2441": 2573,
    "2442": 2574,
    "2443": 2575,
    "2444": 2576,
    "2445": 2577,
    "2446": 2578,
    "2447": 2579,
    "2448": 2580,
    "2449": 2581,
    "2450": 2582,
    "2451": 2583,
    "2452": 2584,
    "2453": 2585,
    "2454": 2586,
    "2455": 2587,
    "2456": 2588,
    "2457": 2589,
    "2458": 2590,
    "2459": 2591,
    "2460": 2592,
    "2461": 2593,
    "2462": 2594,
    "2463": 2595,
    "2464": 2596,
    "2465": 2597,
    "2466": 2598,
    "2467": 2599,
    "2468": 2600,
    "2469": 2601,
    "2470": 2602,
    "2471": 2603,
    "2472": 2604,
    "2473": 2605,
    "2474": 2606,
    "2475": 2607,
    "2476": 2608,
    "2477": 2609,
    "2478": 2610,
    "2479": 2611,
    "2480": 2612,
    "2481": 2613,
    "2482": 2614,
    "2483": 2615,
    "2484": 2616,
    "2485": 2617,
    "2486": 2618,
    "2487": 2619,
    "2488": 2620,
    "2489": 2621,
    "2490": 2622,
    "2491": 2623,
    "2492": 2624,
    "2493": 2625,
    "2494": 2626,
    "2495": 2627,
    "2496": 2628,
    "2497": 2629,
    "2498": 2630,
    "2499": 2631
  },
  "idx2word": {
    "0": "<PAD>",
    "1": "<UNK>",
    "2": "<Q>",
    "3": "<A>",
    "4": "<END>",
    "5": "是",
    "6": "。",
    "7": " ",
    "8": "回答",
    "9": "（",
    "10": "样本",
    "11": "）",
    "12": "这",
    "13": "第",
    "14": "个",
    "15": "示例",
    "16": "？",
    "17": "，",
    "18": "的",
    "19": "学习",
    "20": "什么",
    "21": "你",
    "22": "一个",
    "23": "我",
    "24": "机器",
    "25": "深度",
    "26": "神经网络",
    "27": "很",
    "28": "AI",
    "29": "人工智能",
    "30": "和",
    "31": "Python",
    "32": "一种",
    "33": "你好",
    "34": "高兴",
    "35": "分支",
    "36": "推荐",
    "37": "一部",
    "38": "电影",
    "39": "《",
    "40": "》",
    "41": "非常",
    "42": "可以",
    "43": "=",
    "44": "如何",
    "45": "编程",
    "46": "需要",
    "47": "从",
    "48": "中国",
    "49": "首都",
    "50": "流行",
    "51": "数据",
    "52": "呢",
    "53": "计算",
    "54": "LSTM",
    "55": "PyTorch",
    "56": "框架",
    "57": "TensorFlow",
    "58": "保持",
    "59": "健康",
    "60": "、",
    "61": "一本",
    "62": "未来",
    "63": "31",
    "64": "25",
    "65": "见到",
    "66": "！",
    "67": "叫",
    "68": "名字",
    "69": "助手",
    "70": "为",
    "71": "服务",
    "72": "今天天气",
    "73": "怎么样",
    "74": "今天",
    "75": "天气晴朗",
    "76": "温度",
    "77": "适宜",
    "78": "计算机科学",
    "79": "致力于",
    "80": "创造",
    "81": "智能",
    "82": "肖申克",
    "83": "救赎",
    "84": "经典",
    "85": "会",
    "86": "做",
    "87": "问题",
    "88": "进行",
    "89": "对话",
    "90": "交流",
    "91": "告诉",
    "92": "笑话",
    "93": "为什么",
    "94": "程序员",
    "95": "总是",
    "96": "分不清",
    "97": "万圣节",
    "98": "圣诞节",
    "99": "因为",
    "100": "Oct",
    "101": "Dec",
    "102": "多",
    "103": "练习",
    "104": "开始",
    "105": "入门",
    "106": "哪里",
    "107": "北京",
    "108": "喜欢",
    "109": "颜色",
    "110": "作为",
    "111": "没有",
    "112": "个人",
    "113": "偏好",
    "114": "但",
    "115": "蓝色",
    "116": "通常",
    "117": "受欢迎",
    "118": "编程语言",
    "119": "简单",
    "120": "易学",
    "121": "让",
    "122": "计算机",
    "123": "中",
    "124": "使用",
    "125": "模仿",
    "126": "人脑",
    "127": "神经元",
    "128": "结构",
    "129": "模型",
    "130": "循环",
    "131": "适合",
    "132": "处理",
    "133": "序列",
    "134": "开源",
    "135": "另",
    "136": "均衡",
